Importing pandas, numpy and matpltlib.

In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

The csv file contains some miscellaneous information as the first 8 rows. We use skiprows to avoid any read errors.

In [41]:
df = pd.read_csv('data/FEI_PREF_190228112345.csv', skiprows=8)

Lets take a look at what our data looks like using pandas head() to see the top 5 rows.

In [42]:
df.head()

,AREA Code,AREA,YEAR Code,YEAR,/ITEMS,A1101_Total population (Both sexes)[person],Annotation,A110101_Total population (Male)[person],Annotation.1,A110102_Total population (Female)[person],Annotation.2
0,47000,Okinawa-ken,2016100000,2016,NaN,"1,439,000",NaN,"708,000",NaN,"732,000",NaN
1,47000,Okinawa-ken,2015100000,2015,NaN,"1,433,566",NaN,"704,619",NaN,"728,947",NaN
2,47000,Okinawa-ken,2014100000,2014,NaN,"1,426,000",NaN,"700,000",NaN,"725,000",NaN
3,47000,Okinawa-ken,2013100000,2013,NaN,"1,419,000",NaN,"697,000",NaN,"722,000",NaN
4,47000,Okinawa-ken,2012100000,2012,NaN,"1,411,000",NaN,"693,000",NaN,"719,000",NaN

Now lets look at the kind of info inside the dataframe.

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 11 columns):
AREA Code                                      42 non-null int64
AREA                                           42 non-null object
YEAR Code                                      42 non-null int64
YEAR                                           42 non-null int64
/ITEMS                                         0 non-null float64
A1101_Total population (Both sexes)[person]    42 non-null object
Annotation                                     0 non-null float64
A110101_Total population (Male)[person]        42 non-null object
Annotation.1                                   0 non-null float64
A110102_Total population (Female)[person]      42 non-null object
Annotation.2                                   0 non-null float64
dtypes: float64(4), int64(3), object(4)
memory usage: 3.7+ KB

There is a lot of columns that aren't required for our analysis. We can drop those from the dataframe. I went simple with just the single dropna command to find any columns with NaN values.

In [44]:
df = df.dropna(axis = 'columns')

Lets see what it looks like now.

In [45]:
df.head()

,AREA Code,AREA,YEAR Code,YEAR,A1101_Total population (Both sexes)[person],A110101_Total population (Male)[person],A110102_Total population (Female)[person]
0,47000,Okinawa-ken,2016100000,2016,"1,439,000","708,000","732,000"
1,47000,Okinawa-ken,2015100000,2015,"1,433,566","704,619","728,947"
2,47000,Okinawa-ken,2014100000,2014,"1,426,000","700,000","725,000"
3,47000,Okinawa-ken,2013100000,2013,"1,419,000","697,000","722,000"
4,47000,Okinawa-ken,2012100000,2012,"1,411,000","693,000","719,000"

Now lets set the YEAR column to be the index. I'll also add the parameters drop just so I remember that it drops that particular column when making it into an index and inplace to modify the dataframe in place and not return a new object.

In [46]:
df.set_index('YEAR' , drop = True, inplace=True)

Before we have a look at our dataframe, lets drop the columns AREA Code, AREA and YEAR Code. These are just taking up extra space and I already know all this data is for prefecture Okinawa.

In [47]:
df.drop(['AREA Code', 'AREA', 'YEAR Code'], axis=1, inplace=True)

Again, before we look at our finish dataframe product, lets do the final cleaning of the remaining column names to make them a bit more readable. I'm going to use the new pandas method of set_axis.

In [48]:
df.set_axis(['TOTAL', 'MALE', 'FEMALE'], axis='columns', inplace=True)

Now lets take a look at the whole dataframe.

In [49]:
df

          TOTAL     MALE   FEMALE
YEAR
2016  1,439,000  708,000  732,000
2015  1,433,566  704,619  728,947
2014  1,426,000  700,000  725,000
2013  1,419,000  697,000  722,000
2012  1,411,000  693,000  719,000
2011  1,402,000  688,000  714,000
2010  1,392,818  683,328  709,490
2009  1,385,000  679,000  706,000
2008  1,378,000  675,000  703,000
2007  1,374,000  674,000  700,000
2006  1,369,000  672,000  697,000
2005  1,361,594  668,502  693,092
2004  1,353,000  665,000  689,000
2003  1,345,000  661,000  684,000
2002  1,336,000  657,000  679,000
2001  1,327,000  652,000  675,000
2000  1,318,220  647,877  670,343
1999  1,308,000  642,000  665,000
1998  1,298,000  637,000  661,000
1997  1,289,000  633,000  657,000
1996  1,282,000  629,000  653,000
1995  1,273,440  624,737  648,703
1994  1,262,000  619,000  643,000
1993  1,250,000  613,000  637,000
1992  1,239,000  607,000  632,000
1991  1,230,000  603,000  627,000
1990  1,222,398  598,669  623,729
1989  1,215,000  596,000  620,000
1988  1,208,000  593,000  615,000
1987  1,199,000  589,000  609,000
1986  1,188,000  585,000  603,000
1985  1,179,097  581,102  597,995
1984  1,161,000  572,000  589,000
1983  1,146,000  564,000  582,000
1982  1,132,000  557,000  575,000
1981  1,119,000  550,000  569,000
1980  1,106,559  543,692  562,867
1979  1,094,000  537,000  556,000
1978  1,081,000  530,000  551,000
1977  1,071,000  526,000  545,000
1976  1,058,000  519,000  539,000
1975  1,042,572  510,754  531,818

Now lets see just a few years as a stacked bar graph. This will utlize the matplotlib library.